[
  {
    "title": "Be accountable and take responsibility",
    "description": "Everyone cleans up their own mess, sometimes with help.",
    "date": "20230726141957955",
    "updated": "20230726142045923",
    "text": ""
  },

  {
    "title": "Comparison is the thief of joy",
    "description": "Comparing yourself to others is a great way to beat yourself up for no gain.",
    "date": "20210501092841844",
    "updated": "20230820173212852",
    "text": "<p>I don't have the full story. I maybe don't actually <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Compassion%20and%20curiosity\">know who they are</a>. Even if I do, I'm not interested in being <em>better than someone else</em>, I'm interested in being <em>the best possible me I can be</em>, to experience everything the world has to offer instead of dwelling in my head on imagined faults.</p><p>I should <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Practice%20self-compassion\">Practice self-compassion</a> instead.</p>"
  },

  {
    "title": "Compassion and curiosity",
    "description": "Don't judge; listen. Don't assume you know; ask.",
    "date": "20211104145739131",
    "updated": "20230726135326080",
    "text": "<p>I'm quick to judge. Whether it is a survival skill, a coping strategy, or a consequence of having an over-developed <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Fast%20brain\">Fast brain</a>, I tend to start acting on conclusions before I've fully supported them. I very much want to stop doing that.</p>"
  },

  {
    "title": "Don't wield weapons forged by the right to fight the culture war",
    "description": "I refuse to use soundbites and catch-phrases created by right-wing pundits in my discourse.",
    "date": "20210902145643493",
    "updated": "20230727142025762",
    "text": "<p>They're meant to virally reproduce in our heads and frame debates to their liking; perpetuating them wields their weapons for them. This includes \"cancel culture\", \"tax relief\", \"death tax\", and a hoard of others.</p>"
  },

  {
    "title": "Give a fuck",
    "description": "The joy of life springs from caring and being vulnerable.",
    "date": "20230731144904526",
    "updated": "20230731145425844",
    "text": "<p>It can be scary to care about things. Caring about things makes you vulnerable, costs you something, makes it easier to get hurt if things don't work out. But the alternative is a dusty, dry existence.</p>"
  },

  {
    "title": "It's better to build an intuition than it is to rely on rote practice and memorization.",
    "description": "Training our brains to spot the patterns in our solutions is better than maintaining an ever-growing rolodex of piecemeal solutions.",
    "date": "20220526154701859",
    "updated": "20230727142158009",
    "text": "<p>First captured on <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Josh%20Comeau\">Josh Comeau</a>'s site here: <a class=\"tc-tiddlylink-external\" href=\"https://www.joshwcomeau.com/css/surprising-truth-about-pixels-and-accessibility/#quick-tricks-vs-mental-models\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.joshwcomeau.com/css/surprising-truth-about-pixels-and-accessibility/#quick-tricks-vs-mental-models</a></p><p>And, yes, this is it – this is a great pillar in the <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#I%20don%27t%20like%20the%20term%20%22best%20practices%22\">I don't like the term \"best practices\"</a> argument.</p>"
  },

  {
    "title": "It's okay to make mistakes",
    "description": "It is literally impossible to learn anything without making a mistake and correcting it. So go ahead and make mistakes! ",
    "date": "20220606184551247",
    "updated": "20230820171644129",
    "text": "<p>There are some corollaries to this, though:</p><ul><li><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Practice%20self-compassion\">Practice self-compassion</a> when you do make a mistake.</li><li><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Be%20accountable%20and%20take%20responsibility\">Be accountable and take responsibility</a> for your mistake.</li><li><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#We%27re%20all%20in%20this%20together\">We're all in this together</a>.</li><li>If it's okay to make mistakes, it's okay to tell people about them. Be careful about \"not naming names\", that can create a culture of shame around mistakes.</li></ul>"
  },

  {
    "title": "Just listen, don't fix",
    "description": "When someone is telling you about their personal problems, maybe they don't want solutions right then.",
    "date": "20230727142857798",
    "updated": "20230727143116586",
    "text": "<p>So many times what people want is to vent to a sympathetic ear. If they're not asking for help, don't give it just yet. Be an active listener. Ask about them. Give them space.</p>"
  },

  {
    "title": "No hot takes",
    "description": "Strive for what's right instead of just finding what's funny or popular.",
    "date": "20230515144914113",
    "updated": "20230727142331551",
    "text": "<p>As much as possible, eschew pithy statements on complex topics (but stretch thy vocab, obviously).</p><p>I like being thought of as clever, and I prize communication and understanding and wit. It's generally easy for me to find the quick, witty, humorous take on something and, generally, I think the Internet awards it. But I also want more nuance in my positions, not a \"both-sides\" simplicity, but a slightly deeper exploration on contentious topics than I'm normally willing to give.</p>"
  },

  {
    "title": "Perfect is the enemy of good",
    "description": "Perfection is an unobtainable goal; its pursuit is admirable but, taken too far, can be detrimental.",
    "date": "20230620134316349",
    "updated": "20230727142255544",
    "text": "<p>Release that thing. Show people your stuff. Deploy that app. In so many cases, something is better than nothing.</p><p>Possibly attributable to <a class=\"tc-tiddlylink tc-tiddlylink-missing\" href=\"#Voltaire\">Voltaire</a>.</p>"
  },

  {
    "title": "Practice self-compassion",
    "description": "Remember to treat yourself compassionately as well; you're often your harshest critic.",
    "date": "20220103230131297",
    "updated": "20230726141243367",
    "text": "<p>Life is hard. Give yourself a break.</p><p>Self-castigation doesn't motivate, it just feels bad. <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#What%20would%20a%20friend%20say%20to%20you%3F\">What would a friend say to you?</a> Be a friend to yourself.</p>"
  },

  {
    "title": "Put on your oxygen mask first.",
    "description": "What good am I to others if I don't take care of myself, first?",
    "date": "20211230161539343",
    "updated": "20230727142352063",
    "text": "<p>If I'm not taking care of myself first then I'm no good to Julian.</p><p>I tend to think that if I'm not right by his side as he's going through something that I'm abandoning him. This idea usually has a couple of misconceptions wrapped up in it:</p><ul><li><strong>I'm</strong> the one that's usually upset in these scenarios. I'm really thinking about me.</li><li>I'm probably not going to be my best self taking care of him if I'm really upset.</li></ul><p>It's important to remember this when having tough parenting moments. My tough parenting moments are usually caused by me, not by him.</p>"
  },

  {
    "title": "Stop dunking on conservatives online when they say dumb things",
    "description": "Don't score points, raise the level of discourse, stop gawking at the metaphorical staged roadway accidents while someone else passes you on the road.",
    "date": "20210909152137455",
    "updated": "20230727142820931",
    "text": "<p><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#How%20Libs%20Can%20Stop%20Owning%20Themselves%20Online\">It's a well-known online strategy</a> conservatives use to raise engagement with their social media posts. Every retweet or quote raises the number of people who see the garbage they're saying, so don't do it. <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Greg%20Abbott%20is%20not%20ignorant%20%E2%80%94%20he%27s%20a%20liar\">They know what they're saying isn't true</a>, they are trying to spark outrage and paint the liberals as smug know-it-alls. If you need to comment on it, screenshot it. Signal-boost your friends.</p><p>Attributable to <a class=\"tc-tiddlylink-external\" href=\"https://twitter.com/anildash/status/1234242828328407041\" rel=\"noopener noreferrer\" target=\"_blank\">Anil Dash</a>.</p>"
  },

  {
    "title": "There is no \"just\"",
    "description": "Don't make assumptions about the difficulty level of things others are doing. Or about things you haven't done yet.",
    "date": "20220214153226065",
    "updated": "20220801033758062",
    "text": "<blockquote><div>If only they'd just...</div></blockquote><p>or</p><blockquote><div>They just have to...</div></blockquote><p>Have some <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Compassion%20and%20curiosity\">Compassion and curiosity</a>. That software project is probably larger than you know, that person's inner struggles are larger than they seem, their priorities are not yours. Don't minimize their struggle and context.</p>"
  },

  {
    "title": "User requests are what computers are for",
    "description": "The computer doesn't ask the user to do things, the user asks the computer to do things. Don't bug people to do things for the computer. The user is the most important half of the relationship. Don't waste their time. Don't get in their way. Help them to be awesome.",
    "date": "20220531153655459",
    "updated": "20220801033523873",
    "text": "<p>Why, yes, this is from <a class=\"tc-tiddlylink tc-tiddlylink-missing\" href=\"#Tron\">Tron</a>.</p>"
  },

  {
    "title": "We're all in this together",
    "description": "It's hard for everyone. Be kind to each other.",
    "date": "20220602183234705",
    "updated": "20230726142508909",
    "text": "<p>Pretty much everyone is doing their best at that moment. Practice <a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#Compassion%20and%20curiosity\">Compassion and curiosity</a>. Give people the benefit of the doubt.</p>"
  },

  {
    "title": "What is the goal?",
    "description": "Progress is impossible without a goal.",
    "date": "20211209164642184",
    "updated": "20230726135518964",
    "text": "<p>You can't be finished with something unless you know the goal. Knowing what you want to accomplish should decide your actions.</p><blockquote class=\"drhayes-quote\"><p><div class=\"quote-link\"><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#When%20it%20is%20obvious%20the%20goals%20cannot%20be%20reached\">🔗</a></div></p><p>When it is obvious that the goals cannot be reached, don't adjust the goals, adjust the action steps.\n</p><p><cite><a class=\"tc-tiddlylink tc-tiddlylink-resolves\" href=\"#When%20it%20is%20obvious%20the%20goals%20cannot%20be%20reached\">Confucius</a></cite></p></blockquote>"
  },

  {
    "title": "Words mean things",
    "description": "The words we choose matter and carry weight",
    "date": "20220214223846256",
    "updated": "20230726140750036",
    "text": "<p>When someone speaks, listen to what they are saying and how they're saying it. Believe them.</p><p>If words didn't matter...</p><ul><li>It wouldn't be called \"tax relief\" or a \"death tax\", it'd just be a tax.</li><li>We'd use the pronouns someone prefers.</li><li>Advertising wouldn't be a thing.</li></ul><p>Yet, in all those cases, someone has chosen the particular words they are using because of what they mean and the words' effect on someone else. They're communicating something.</p><p>How someone frames an issue that they're speaking or writing about tells you a lot about what they are thinking, where they're coming from. Listen to them and <em>believe them</em>.</p>"
  }
]
